savvn001/STM32_FLIGHT_CONTROLLER/Drivers/IMU.c
/*
 * IMU.c
 *
 *  Created on: Jun 19, 2019
 *      Author: nick_savva
 */

#include "IMU.h"
#include "stm32f4xx_hal.h"
#include "arm_math.h"


//Timer clock frequency, in this case same as MCU frequency, 100MHz
#define TIMER_CLK_FREQ 100000000.0f

I2C_HandleTypeDef hi2c2;

float sum = 0;
uint32_t sumCount = 0, mcount = 0;

// Set initial input parameters
enum Ascale {
	AFS_2G = 0, AFS_4G, AFS_8G, AFS_16G
};

enum Gscale {
	GFS_250DPS = 0, GFS_500DPS, GFS_1000DPS, GFS_2000DPS
};

enum Mscale {
	MFS_14BITS = 0, // 0.6 mG per LSB
	MFS_16BITS      // 0.15 mG per LSB
};

uint8_t Ascale = AFS_2G;     // AFS_2G, AFS_4G, AFS_8G, AFS_16G
uint8_t Gscale = GFS_250DPS; // GFS_250DPS, GFS_500DPS, GFS_1000DPS, GFS_2000DPS
uint8_t Mscale = MFS_16BITS; // MFS_14BITS or MFS_16BITS, 14-bit or 16-bit magnetometer resolution
uint8_t Mmode = 0x06; // Either 8 Hz 0x02) or 100 Hz (0x06) magnetometer data ODR
float aRes, gRes, mRes;      // scale resolutions per LSB for the sensors



int16_t accelCount[3];  // Stores the 16-bit signed accelerometer sensor output
int16_t gyroCount[3];   // Stores the 16-bit signed gyro sensor output
int16_t magCount[3];    // Stores the 16-bit signed magnetometer sensor output
float magCalibration[3] = { 0, 0, 0 }, magbias[3] = { 0, 0, 0 }; // Factory mag calibration and mag bias
float gyroBias[3] = { 0, 0, 0. }, accelBias[3] = { 0, 0., 0.}; // Bias corrections for gyro and accelerometer
float magScale[3] = {1,1,1};
float ax, ay, az, gx, gy, gz, mx, my, mz; // variables to hold latest sensor data values
int16_t tempCount; // Stores the real internal chip temperature in degrees Celsius
float temperature;
float SelfTest[6];

int delt_t = 0; // used to control display output rate
int count = 0;  // used to control display output rate

// parameters for 6 DoF sensor fusion calculations
//#define PI 3.14159265358979323846 //PI DEFINED IN arm_math.h
float GyroMeasError = PI * (60.0f / 180.0f); // gyroscope measurement error in rads/s (start at 60 deg/s), then reduce after ~10 s to 3
float beta = sqrt(3.0f / 4.0f) * PI * (60.0f / 180.0f);  // compute beta
float GyroMeasDrift = PI * (1.0f / 180.0f); // gyroscope measurement drift in rad/s/s (start at 0.0 deg/s/s)
float zeta = sqrt(3.0f / 4.0f) * PI * (1.0f / 180.0f); // compute zeta, the other free parameter in the Madgwick scheme usually set to a small or zero value
#define Kp 2.0f * 5.0f // these are the free parameters in the Mahony filter and fusion scheme, Kp for proportional feedback, Ki for integral
#define Ki 0.0f

float pitch, yaw, roll;
float deltat = 0.0f;             // integration interval for both filter schemes
float32_t lastUpdate = 0, firstUpdate = 0, Now = 0; // used to calculate integration interval                               // used to calculate integration interval
float q[4] = { 1.0f, 0.0f, 0.0f, 0.0f };           // vector to hold quaternion
float eInt[3] = { 0.0f, 0.0f, 0.0f }; // vector to hold integral error for Mahony method




/***************************** METHODS  **********************************/

IMU_StatusTypeDef imu_init(I2C_HandleTypeDef* handle) {

	printf("STM32 Online..\r\n");

	//Check if MPU9250 responds
	if (HAL_I2C_IsDeviceReady(handle, 0xD0, 2, 100) == HAL_OK) {
		HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5); //Toggle LED on if so
	}
	else{
		while(1);
	}

	uint8_t whoami = readByte(MPU9250_ADDRESS_TX, MPU9250_ADDRESS_RX,
	WHO_AM_I_MPU9250);  // Read WHO_AM_I register for MPU9250

	if (whoami == 0x71) {
		printf("MPU9250 online..\r\n");
		printf("whoami reg = %d ..\r\n", whoami);

		//uint8_t UART_TX_DATA[13] = "MPU9250 online..\r\n";
		//HA L_UART_Transmit(&huart2, UART_TX_DATA, 13, 10);
	}


	return IMU_SUCCESS;

}

IMU_StatusTypeDef imu_calibrate() {

	//************** Calibration sequence for MPU9250 **************
	//This is mostly taken from the library example https://os.mbed.com/users/onehorse/code/MPU9250AHRS/file/4e59a37182df/main.cpp/
	//but adapted slightly for this platform

	resetMPU9250();
	MPU9250SelfTest(SelfTest); // Start by performing self test and reporting values

	printf(	"x-axis self test: acceleration trim within : %f of factory value\n\r", SelfTest[0]);
	printf(
			"y-axis self test: acceleration trim within : %f of factory value\n\r",
			SelfTest[1]);
	printf(
			"z-axis self test: acceleration trim within : %f of factory value\n\r",
			SelfTest[2]);
	printf("x-axis self test: gyration trim within : %f  of factory value\n\r",
			SelfTest[3]);
	printf("y-axis self test: gyration trim within : %f  of factory value\n\r",
			SelfTest[4]);
	printf("z-axis self test: gyration trim within : %f  of factory value\n\r",
			SelfTest[5]);

	calibrateMPU9250(gyroBias, accelBias); // Calibrate gyro and accelerometers, load biases in bias registers

	printf("x gyro bias = %f\n\r", gyroBias[0]);
	printf("y gyro bias = %f\n\r", gyroBias[1]);
	printf("z gyro bias = %f\n\r", gyroBias[2]);
	printf("x accel bias = %f\n\r", accelBias[0]);
	printf("y accel bias = %f\n\r", accelBias[1]);
	printf("z accel bias = %f\n\r", accelBias[2]);

	initMPU9250();
	initAK8963(magCalibration);


	printf("Accelerometer full-scale range = %f  g\n\r", 2.0f*(float)(1<<Ascale));
	printf("Gyroscope full-scale range = %f  deg/s\n\r", 250.0f*(float)(1<<Gscale));

	getAres(); // Get accelerometer sensitivity
	getGres(); // Get gyro sensitivity
	getMres(); // Get magnetometer sensitivity


	//magcalMPU9250(magbias, magScale);

	magbias[0]	=	64.231575;
	magbias[1]	=	-151.403;
	magbias[2]	=	117.918869;

	magScale[0]	=	0.698056817;
	magScale[1]	=	1.17042613;
	magScale[2]	=	1.4024024;


	return IMU_SUCCESS;

}

void calc_RollPitchYaw(int counter_value) {

	//******* Get roll pitch & yaw values from registers (also from library example but adapted slightly) ********

	// If intPin goes high, all data registers have new data
	if (readByte(MPU9250_ADDRESS_TX, MPU9250_ADDRESS_RX, INT_STATUS) & 0x01) { // On interrupt, check if data ready interrupt

		readAccelData(accelCount);  // Read the x/y/z adc values
		// Now we'll calculate the accleration value into actual g's
		ax = (float) accelCount[0] * aRes - accelBias[0]; // get actual g value, this depends on scale being set
		ay = (float) accelCount[1] * aRes - accelBias[1];
		az = (float) accelCount[2] * aRes - accelBias[2];

		readGyroData(gyroCount);  // Read the x/y/z adc values
		// Calculate the gyro value into actual degrees per second
		gx = (float) gyroCount[0] * gRes - gyroBias[0]; // get actual gyro value, this depends on scale being set
		gy = (float) gyroCount[1] * gRes - gyroBias[1];
		gz = (float) gyroCount[2] * gRes - gyroBias[2];

